<a href="https://colab.research.google.com/github/ihertting/CS167_Notes/blob/main/Day03_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Your name here</b><br>
Date: February 4, 2020
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

In [1]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv("/content/drive/MyDrive/datasets/titanic.csv")
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [3]:
# what is the data type of titanic?
type(titanic)

pandas.core.frame.DataFrame

In [5]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [6]:
# display only the 'embark_town' column of the titanic data
titanic['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [7]:
# what is the data type of the result of the previous cell? 
type(titanic['embark_town'])

pandas.core.series.Series

In [4]:
# what is the "shape" of the data frame? -- number of elements in the data frame
titanic.shape

(891, 15)

In [11]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows
subset = titanic.tail(20)
subset.shape

(20, 15)

In [22]:
# use loc to print out the data for passenger 890 on the titanic dataframe
titanic.loc[890]
# use iloc to print out the data for passenger 890 on the subest dataframe
subset.iloc[19]

survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [ ]:
# use a markdown cell; describe the difference between loc and iloc

The difference between loc and iloc is that loc uses actual values and iloc uses index values.

In [29]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function
queenstown_subset = titanic[ titanic['embark_town'] == 'Queenstown']
queenstown_subset

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5           0       3    male   NaN  ...   NaN   Queenstown     no   True
16          0       3    male   2.0  ...   NaN   Queenstown     no  False
22          1       3  female  15.0  ...   NaN   Queenstown    yes   True
28          1       3  female   NaN  ...   NaN   Queenstown    yes   True
32          1       3  female   NaN  ...   NaN   Queenstown    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
790         0       3    male   NaN  ...   NaN   Queenstown     no   True
825         0       3    male   NaN  ...   NaN   Queenstown     no   True
828         1       3    male   NaN  ...   NaN   Queenstown    yes   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[77 rows x 15 columns]

In [30]:
# how many passengers are in queenstown_subset?
len(queenstown_subset)

77

In [32]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset['fare'].mean()

13.276029870129872

In [51]:
# what is the average age for all of those in the queenstown_subset?
queenstown_avg_age = queenstown_subset['age'].mean()
# do all of the passengers have an age recorded? What is recorded if there is no age?
len(queenstown_subset[queenstown_subset['age'].isnull() == True])
print('49 of the 77 passengers in the queenstown_subset do not have an age recorded. NaN is recorded if there is no age')

49 of the 77 passengers in the queenstown_subset do not have an age recorded. NaN is recorded if there is no age

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

unique() -- returns only unique values, no duplicates
mean()   -- returns the average value
isnull() -- checks whether it is Not A Number/ NaN
fillna() -- replaces null values with a chosen value

In [61]:
# give examples of your use of unique(), mean(), median(), isnull()
titanic['embark_town'].unique()
titanic['age'].mean()
titanic['age'].median()
titanic[titanic['embark_town'].isnull() == True]

     survived  pclass     sex   age  ...  deck  embark_town  alive alone
61          1       1  female  38.0  ...     B          NaN    yes  True
829         1       1  female  62.0  ...     B          NaN    yes  True

[2 rows x 15 columns]

In [52]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()
queenstown_subset.fillna(queenstown_avg_age)

     survived  pclass     sex        age  ...     deck  embark_town  alive  alone
5           0       3    male  28.089286  ...  28.0893   Queenstown     no   True
16          0       3    male   2.000000  ...  28.0893   Queenstown     no  False
22          1       3  female  15.000000  ...  28.0893   Queenstown    yes   True
28          1       3  female  28.089286  ...  28.0893   Queenstown    yes   True
32          1       3  female  28.089286  ...  28.0893   Queenstown    yes   True
..        ...     ...     ...        ...  ...      ...          ...    ...    ...
790         0       3    male  28.089286  ...  28.0893   Queenstown     no   True
825         0       3    male  28.089286  ...  28.0893   Queenstown     no   True
828         1       3    male  28.089286  ...  28.0893   Queenstown    yes   True
885         0       3  female  39.000000  ...  28.0893   Queenstown     no  False
890         0       3    male  32.000000  ...  28.0893   Queenstown     no   True

[77 rows x 15 columns]

In [44]:
# load in the iris data
irisData = pandas.read_csv("/content/drive/MyDrive/datasets/irisData.csv")
irisData.head()
# what is the median sepal width of just the Setosas?
setosas = irisData[irisData['species'] == 'Iris-setosa']
setosas['sepal width'].median()

3.4

In [50]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
versicolor = irisData[(irisData['species'] == 'Iris-versicolor') & (irisData['petal length'] > 4)]
versicolor['sepal width'].mean()

2.902941176470588